////////////////////
/* 　フィールド関連  */
////////////////////
var walkCol = [ //歩ける色のリスト 全フィールド共通
    [192,255,255],[102,255,255]
]
var fieldbackdata=[ //フィールドの背景の長方形データをすべて格納（主に歩ける部分）
    [["rgba(192,255,255,1)",0,0,960,540]],
    [["rgba(102,255,255,1)",0,0,960,540]],
    [["0x220000",0,0,4000,4000]],
    [["0x220000",0,0,4000,4000]],
    [["0x220000",0,0,4000,4000]],
    [["0x220000",0,0,4000,4000]]
]
var fielddata=[ //フィールドの画像データが全て格納されている
    [[100,140],[300,155],[320,550],[1000,820],[1000,900],[1320,750]],//フィールド0
    [[100,140],[300,155],[320,550],[1000,820],[1000,900],[1320,750]], //フィールド1
    [], //フィールド2
    [], //フィールド3
    [], //フィールド4
    [] //フィールド5
]
var fieldwarpobj=[
    [[940,0,20,540,1,40,30]],//フィールドのワープ場所のデータ　[x,y,width,height,jmpWorld,jmpx,jmpy]
    [[0,0,20,540,0,920,30]]
]
var eventobj=[
    [[30,30,50,50,1]],//フィールドのイベント場所のデータ　[x,y,width,height,eventnum]
    []
]

////////////////////
/* 　敵データ　     */
////////////////////


////////////////////
/* 　アイテムデータ  */
////////////////////
var itemdata=[ //[0:アイテム名,1:フィールドで使用可能?(off:0,on:1),2:バトルで使用可能？(off:0,on:1), 3:説明 4:たまごならたまご番号　それ以外は-1
    ["ふつうの薬草",1,1,"HPを30ぐらい回復する",-1],
    ["高級な薬草",1,1],
    ["特上の薬草",1,1],
    ["おいしい水",1,1],
    ["甘いジュース",1,1],
    ["スポーツドリンク",1,1],
    ["シンプルなクッキー",1,1],
    ["アーモンドクッキー",1,1],
    ["アタックブースト",0,1],
    ["ガードブースト",0,1],
    ["プロテイン",0,1],
    ["金運の知らせ",0,1],
    ["マイピク強化の初級指南書",1,0],
    ["マイピク強化の中級指南書",1,0],
    ["マイピク強化の上級指南書",1,0],
    ["安全帰還の教え",1,0],
    ["虫除けスプレー",1,0],
    ["ピカチュウの卵",0,0,"たまご",0]
]

////////////////////
/* 　とくせい一覧   */
////////////////////
var specialAvilityText=["つよい","すばやい","よわい","なきむし","つよがり","ヒステリック","きんちょう","エスパー","のろい"];

////////////////////
/* 　わざ一覧　　   */
////////////////////
var skillData=[
    //無属性(0)
    ["はたく", 20,100,0,0],
    ["たいあたり",30,100,0,0],
    ["しんきろう",50,100,0,1],
    ["タックル",60,100,0,3],
    ["まわしげり", 80,85,0,3],
    ["せいけんづき", 95,95,0,6],
    ["なぐるぼこぼこ",500,25,0,3],
    ///////

    //火属性(1)
    ["ほたるび", 25,100,1,0],
    ["ぐれんのや", 40,100,1,0],
    ["かえんだん",50,100,1,1],
    ["火柱の怒り", 60,100,1,1],
    ["不知火のまい",75,90,1,1],
    ["かえんほうしゃ", 80,100,1,3],
    ["りゅうせい火",100,85,1,4],
    ["粉塵爆発",150,45,1,3],
    ///////

    //水属性(2)
    ["しぐれ", 25,100,2,0],
    ["マリンジェット",50,80,2,0],
    ["みずのはどう",60,100,2,2],
    ["アイスブレード",70,90,2,2],
    ["ねっとう", 80,100,2,4],
    ["ぜったいれいど", 100,90,2,6],
    ["こうずい", 120,50,2,4],
    ///////

    //木属性(3)
    ["だいちのいのり",30,100,3,0],
    ["花のおどり",45,100,3,1],
    ["きゅうしゅう",65,100,3,2],
    ["リーフネット",60,90,3,1],
    ["もりのざわめき",70,100,3,4],
    ["ウッドバット",80,90,3,4],
    ["ブランチカット",95,85,3,3],
    ["花ばくだん",140,50,3,6],
    ///////

    //風属性(4)
    ["とっぷう",40,100,4,0],
    ["すなあらし", 50,100,4,1],
    ["ソウルブラスト",70,100,4,2],
    ["たつまき", 85,85,4,4],
    ["ハリケーン",110,70,4,5],
    ///////

    //岩属性(5)
    ["かたいいし",25,100,5,0],
    ["いしのねがい",45,80,5,0]
    ["いわなだれ", 60,100,5,2],
    ["メタルパンチ",70,90,5,3],
    ["ロックガン",80,100,5,4],
    ["じしん", 100,90,5,6],
    ["マッハストーン", 130,55,5,5],
    ///////

    //幻属性(6)
    ["魔導書のおしえ",30,100,6,0],
    ["マジカルX", 50,100,6,2],
    ["スターバースト", 75,90,6,2],
    ["かみのいかり", 90,100,6,5],
    ["せつなの輝き", 100,100,6,8],
    ["いんせきほう", 140,50,6,6]
    ///////
];
//0:"なまえ"　1:攻撃力(0-999)　2:命中率(0-100)　3:属性(0-6)　4:消費MP(0-99)

////////////////////
/* 　ぞくせい一覧   */
////////////////////
var typeDataText=["ー","火","水","木","風","岩","幻"];
var typeDataCol=["255,255,255","255,200,200","200,200,255","200,100,0","200,200,200","100,100,100","255,200,0"];

////////////////////
/* 　たまご一覧　   */
////////////////////
var eggData=[
    [],
    [],
    []
]